app/controllers/home_controller.rb

  def index
    @categories = Category.all
    @buyable		= Project.find_all_by_project_status(Project.PROJECT_STATUS[:in_progress])
---
SELECT "categories".* FROM "categories"
SELECT "projects".* FROM "projects" WHERE "projects"."project_status" IN (20, 30)