app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "4"]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @project = Project.find(params[:id])
    @category = Category.find(@project.category_id)
    @member = Member.find(@project.member_id)