app/controllers/transact_controller.rb

  def invest
    @project = Project.find(params[:id])
    @category = Category.find(@project.category_id).title
    @member = Member.find(@project.member_id)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "4"]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
SELECT "members".* FROM "members" WHERE "members"."id" = 1 LIMIT 1

  def donate
    @project = Project.find(params[:id])
    @category = Category.find(@project.category_id).title
    @member = Member.find(@project.member_id)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "4"]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
SELECT "members".* FROM "members" WHERE "members"."id" = 1 LIMIT 1